abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_hw_abstraction.c
// -----------------------------------------------------------------------------
//                                   Includes
// -----------------------------------------------------------------------------
#include "oepl_hw_abstraction.h"
#include "oepl_nvm.h"
#include "oepl_app.h"
#include "oepl_radio.h"
#include "oepl_display.h"
#include "oepl_display_diag.h"

#include "em_cmu.h"
#include "em_gpio.h"
#include "em_emu.h"
#include "em_wdog.h"
#include "em_i2c.h"
#include "em_iadc.h"
#include "em_rmu.h"
#include "gpiointerrupt.h"
#include "sl_sleeptimer.h"
#include "sl_power_manager.h"
#include "app_properties_config.h"

#include <stdio.h>
#include <stdarg.h>

#include "sl_udelay.h"
#include "sl_mx25_flash_shutdown.h"
#include "sl_rail_util_pti_config.h"
#include "oepl_efr32_hwtypes.h"
#include <sl_iostream_handles.h>
#include "sl_rail_util_init.h"
#include "rail.h"

// Todo: abstract away for boards

// -----------------------------------------------------------------------------
//                              Configuration values
// -----------------------------------------------------------------------------
#ifndef HW_ABSTRACTION_DEBUG_PRINT
#define HW_ABSTRACTION_DEBUG_PRINT 1
#endif

// -----------------------------------------------------------------------------
//                              Macros and Typedefs
// -----------------------------------------------------------------------------
#if HW_ABSTRACTION_DEBUG_PRINT
#define DPRINTF(fmt_, ...) oepl_hw_debugprint(DBG_HW, (fmt_), ##__VA_ARGS__)
#else
#define DPRINTF(...)
#endif

// -----------------------------------------------------------------------------
//                          Static Function Declarations
// -----------------------------------------------------------------------------
static void em_cb(sl_power_manager_em_t from, sl_power_manager_em_t to);
static void gpioint_cb(uint8_t pin, void* ctx);
static void hardware_error_handler(void);

// -----------------------------------------------------------------------------
//                                Global Variables
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
//                                Static Variables
// -----------------------------------------------------------------------------
static uint8_t hwid;

static sl_power_manager_em_transition_event_handle_t event_handle;
static const sl_power_manager_em_transition_event_info_t event_info = {
    .event_mask = SL_POWER_MANAGER_EVENT_TRANSITION_ENTERING_EM2 | SL_POWER_MANAGER_EVENT_TRANSITION_ENTERING_EM3 |
                  SL_POWER_MANAGER_EVENT_TRANSITION_LEAVING_EM2 | SL_POWER_MANAGER_EVENT_TRANSITION_LEAVING_EM3,
    .on_event = em_cb
};

static uint8_t button1_hwval, button2_hwval, gpio_hwval, nfcfd_hwval, nfcpwr_hwval, nfcsda_hwval;
static uint8_t white_hwval, red_hwval, blue_hwval, green_hwval;
static void* gpio_cb = NULL;

static bool is_devkit = false;

// Deepsleep entry timer will periodically check if the radio is idle so that
// we can enter deepsleep.
static sl_sleeptimer_timer_handle_t deepsleep_entry_timer_handle;
static sl_sleeptimer_timer_handle_t nfc_poll_timer_handle;

// -----------------------------------------------------------------------------
//                          Public Function Definitions
// -----------------------------------------------------------------------------

// Override of a GSDK power manager application hook. Tells the power manager
// (called from the main event loop) whether it is OK to go to sleep.
bool app_is_ok_to_sleep(void)
{
  if(oepl_display_is_drawing()) {
    //DPRINTF("$");
    return true;
  } else if(oepl_radio_is_event_pending() || oepl_app_is_event_pending()) {
    DPRINTF("@");
    return false;
  } else {
    return true;
  }
}

// Override of a GSDK power manager application hook. Tells the power manager
// (called from the main event loop) whether the application has events to
// process (otherwise it might go back down to sleep immediately).
sl_power_manager_on_isr_exit_t app_sleep_on_isr_exit(void)
{
  // The things we might have been awoken for:
  // - radio event
  // - button press
  // - application timer (todo)
  // - other subtask event, e.g. display SPI (todo)
  if(oepl_radio_is_event_pending() || oepl_app_is_event_pending() || oepl_display_is_drawing()) {
    return SL_POWER_MANAGER_WAKEUP;
  } else {
    return SL_POWER_MANAGER_SLEEP;
  }
}

static void nfc_poll_timer_cb(sl_sleeptimer_timer_handle_t *handle, void *data)
{
  (void)handle;
  (void)data;
  //GPIO_PinModeSet((nfcsda_hwval & 0x70) >> 4, nfcsda_hwval & 0xF, gpioModePushPull, 1);
  
  if((nfcfd_hwval & 0x70) == 0x20 ||
     (nfcfd_hwval & 0x70) == 0x30) {
    // FD pin is on port C or D, meaning we need to do manual polling.
    if(GPIO_PinInGet((nfcfd_hwval & 0x70) >> 4, nfcfd_hwval & 0xF)) {
      gpioint_cb(nfcfd_hwval & 0xF, gpio_cb);
    }
  }

  if((nfcpwr_hwval & 0x70) == 0x20 ||
     (nfcpwr_hwval & 0x70) == 0x30) {
    // FD pin is on port C or D, meaning we need to do manual polling.
    if(GPIO_PinInGet((nfcpwr_hwval & 0x70) >> 4, nfcpwr_hwval & 0xF)) {
      gpioint_cb(nfcfd_hwval & 0xF, gpio_cb);
    }
  }

  //GPIO_PinModeSet((nfcsda_hwval & 0x70) >> 4, nfcsda_hwval & 0xF, gpioModeInput, 0);
}

static void oepl_hw_solum_extflash_wake(const oepl_efr32xg22_tagconfig_t* tagconfig)
{
  if(tagconfig == NULL || tagconfig->nfc == NULL) {
    return;
  }

  GPIO_PinModeSet(tagconfig->nfc->SCL.port, tagconfig->nfc->SCL.pin, gpioModeWiredAndFilter, 0);
  GPIO_PinModeSet(tagconfig->nfc->SDA.port, tagconfig->nfc->SDA.pin, gpioModeWiredAndFilter, 0);
  GPIO_PinModeSet(tagconfig->nfc->power.port, tagconfig->nfc->power.pin, gpioModeWiredOrPullDown, 1);
  sl_udelay_wait(40000);

  {
    I2C_Init_TypeDef i2cInit = I2C_INIT_DEFAULT;
    size_t i2cnum;
    switch((uint32_t)tagconfig->nfc->i2c) {
      #if defined(I2C0)
      case (uint32_t) I2C0:
        i2cnum = 0;
        CMU_ClockEnable(cmuClock_I2C0, true);
        break;
      #endif
      #if defined(I2C1)
      case (uint32_t) I2C1:
        i2cnum = 1;
        CMU_ClockEnable(cmuClock_I2C1, true);
        break;
      #endif
      #if defined(I2C2)
      case (uint32_t) I2C2:
        i2cnum = 2;
        CMU_ClockEnable(cmuClock_I2C2, true);
        break;
      #endif
      default:
        oepl_hw_crash(DBG_HW, false, "Unknown I2C peripheral\n");
        while(1);
    }

