abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_hw_abstraction.c
    GPIO->I2CROUTE[i2cnum].SDAROUTE = (GPIO->I2CROUTE[0].SDAROUTE & ~_GPIO_I2C_SDAROUTE_MASK)
                          | (tagconfig->nfc->SDA.port << _GPIO_I2C_SDAROUTE_PORT_SHIFT
                          | (tagconfig->nfc->SDA.pin << _GPIO_I2C_SDAROUTE_PIN_SHIFT));
    GPIO->I2CROUTE[i2cnum].SCLROUTE = (GPIO->I2CROUTE[0].SCLROUTE & ~_GPIO_I2C_SCLROUTE_MASK)
                          | (tagconfig->nfc->SCL.port << _GPIO_I2C_SCLROUTE_PORT_SHIFT
                          | (tagconfig->nfc->SCL.pin << _GPIO_I2C_SCLROUTE_PIN_SHIFT));
    GPIO->I2CROUTE[i2cnum].ROUTEEN = GPIO_I2C_ROUTEEN_SDAPEN | GPIO_I2C_ROUTEEN_SCLPEN;
    I2C_Init(tagconfig->nfc->i2c, &i2cInit);
    tagconfig->nfc->i2c->CTRL = I2C_CTRL_AUTOSN;
  }

  {
    I2C_TransferSeq_TypeDef i2cTransfer;
    I2C_TransferReturn_TypeDef result;
    uint8_t txBuffer[2] = { 0x21, 0x04 };
    i2cTransfer.addr = 0x30 << 1;
    i2cTransfer.flags = I2C_FLAG_WRITE;
    i2cTransfer.buf[0].data = txBuffer;
    i2cTransfer.buf[0].len = 2;
    i2cTransfer.buf[1].data = NULL;
    i2cTransfer.buf[1].len = 0;
    result = I2C_TransferInit(I2C0, &i2cTransfer);
    while (result == i2cTransferInProgress) {
      result = I2C_Transfer(I2C0);
    }
    if (result != i2cTransferDone) {
      DPRINTF("I2C fail %08x\n", result);
    }
  }

  {
    I2C_TransferSeq_TypeDef i2cTransfer;
    I2C_TransferReturn_TypeDef result;
    uint8_t txBuffer[2] = { 0x25, 0x00 };
    i2cTransfer.addr = 0x30 << 1;
    i2cTransfer.flags = I2C_FLAG_WRITE_READ;
    i2cTransfer.buf[0].data = txBuffer;
    i2cTransfer.buf[0].len = 1;
    i2cTransfer.buf[1].data = &txBuffer[1];
    i2cTransfer.buf[1].len = 1;
    result = I2C_TransferInit(I2C0, &i2cTransfer);
    while (result == i2cTransferInProgress) {
      result = I2C_Transfer(I2C0);
    }
    if (result != i2cTransferDone) {
      DPRINTF("I2C fail %08x\n", result);
    } else {
      DPRINTF("I2C Response %02x\n", txBuffer[1]);
    }
  }

  sl_udelay_wait(20000);

  {
    I2C_TransferSeq_TypeDef i2cTransfer;
    I2C_TransferReturn_TypeDef result;
    uint8_t txBuffer[1 + 16];
    txBuffer[0] = 0x30;
    i2cTransfer.addr = 0x43 << 1;
    i2cTransfer.flags = I2C_FLAG_WRITE_READ;
    i2cTransfer.buf[0].data = txBuffer;
    i2cTransfer.buf[0].len = 1;
    i2cTransfer.buf[1].data = txBuffer;
    i2cTransfer.buf[1].len = 16;
    result = I2C_TransferInit(I2C0, &i2cTransfer);
    while (result == i2cTransferInProgress) {
      result = I2C_Transfer(I2C0);
    }
    if (result != i2cTransferDone) {
      DPRINTF("I2C fail %08x\n", result);
    } else {
      DPRINTF("I2C Response: ");
      for(size_t i = 0; i < sizeof(txBuffer) - 1; i++) {
        DPRINTF("%02x ", txBuffer[1+i]);
      }
    }
  }

  sl_udelay_wait(20000);

  {
    I2C_TransferSeq_TypeDef i2cTransfer;
    I2C_TransferReturn_TypeDef result;
    uint8_t txBuffer[2] = { 0x21, 0x01 };
    i2cTransfer.addr = 0x30 << 1;
    i2cTransfer.flags = I2C_FLAG_WRITE;
    i2cTransfer.buf[0].data = txBuffer;
    i2cTransfer.buf[0].len = 2;
    i2cTransfer.buf[1].data = NULL;
    i2cTransfer.buf[1].len = 0;
    result = I2C_TransferInit(I2C0, &i2cTransfer);
    while (result == i2cTransferInProgress) {
      result = I2C_Transfer(I2C0);
    }
    if (result != i2cTransferDone) {
      DPRINTF("I2C fail %08x\n", result);
    }
  }

  sl_udelay_wait(14000);
}

static void oepl_hw_solum_extflash_sleep(const oepl_efr32xg22_tagconfig_t* tagconfig)
{
  if(tagconfig == NULL || tagconfig->nfc == NULL) {
    return;
  }

  GPIO_PinOutClear(tagconfig->nfc->power.port, tagconfig->nfc->power.pin);
  GPIO_PinModeSet(tagconfig->nfc->SCL.port, tagconfig->nfc->SCL.pin, gpioModeInput, 1);
  GPIO_PinModeSet(tagconfig->nfc->SDA.port, tagconfig->nfc->SDA.pin, gpioModeInput, 1);
  GPIO_PinModeSet(tagconfig->nfc->power.port, tagconfig->nfc->power.pin, gpioModeInput, 1);
  nfcpwr_hwval = 0x80 | (tagconfig->nfc->power.port << 4) | tagconfig->nfc->power.pin;
  nfcsda_hwval = 0x80 | (tagconfig->nfc->SDA.port << 4) | tagconfig->nfc->SDA.pin;
}

void oepl_hw_init(void)
{
  // Disable these pins, they're decoy pins used to make the SDK's debug EUART config happy
  GPIO_PinModeSet(gpioPortB, 5, gpioModeDisabled, 1);
  GPIO_PinModeSet(gpioPortB, 6, gpioModeDisabled, 1);
  GPIO_PinModeSet(gpioPortB, 7, gpioModeDisabled, 1);
  GPIO_PinModeSet(gpioPortB, 8, gpioModeDisabled, 1);

  const oepl_efr32xg22_tagconfig_t* tagconfig = oepl_efr32xg22_get_config();
  if(tagconfig == NULL) {
    // Shoot this in the ether. It may or may not work since no hardware has been set up.
    DPRINTF("No hardware configuration defined\n");
    while(1) {
      sl_power_manager_sleep();
    }
  }

  // Setup debugprint infrastructure
  extern sl_iostream_instance_info_t sl_iostream_instance_euart_debug_info;
  #if SL_CATALOG_IOSTREAM_RTT_PRESENT
  extern sl_iostream_instance_info_t sl_iostream_instance_rtt_info;
  #endif
  extern sl_iostream_instance_info_t sl_iostream_instance_swo_info;

  if(tagconfig->debug->type != DBG_SWO) {
    // Stop messing with the SWO pin as we may be reusing it somewhere else
    GPIO_DbgSWOEnable(false);
    GPIO_PinModeSet((GPIO_Port_TypeDef)GPIO_SWV_PORT, GPIO_SWV_PIN, gpioModeDisabled, 0);
  }

  if(tagconfig->debug->type != DBG_EUART) {
    // Turn off EUART when not in use to avoid it taking control over pins it shouldn't
    extern sl_iostream_uart_t *sl_iostream_uart_euart_debug_handle;
    sl_iostream_uart_deinit(sl_iostream_uart_euart_debug_handle);
  }

  // Set the requested debug print output
  switch(tagconfig->debug->type)
  {
    case DBG_SWO:
      sl_iostream_set_system_default(sl_iostream_instance_swo_info.handle);
      break;
    #if SL_CATALOG_IOSTREAM_RTT_PRESENT
    case DBG_RTT:
      sl_iostream_set_system_default(sl_iostream_instance_rtt_info.handle);
      break;
    #endif
    case DBG_EUART:
      // Adjust the pinout for the EUART
      GPIO_PinModeSet(tagconfig->debug->output.euart.tx.port, tagconfig->debug->output.euart.tx.pin, gpioModePushPull, 1);

      GPIO->EUARTROUTE->TXROUTE = (tagconfig->debug->output.euart.tx.port << _GPIO_EUART_TXROUTE_PORT_SHIFT)
                                | (tagconfig->debug->output.euart.tx.pin << _GPIO_EUART_TXROUTE_PIN_SHIFT);
      if(tagconfig->debug->output.euart.rx.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->debug->output.euart.rx.port, tagconfig->debug->output.euart.rx.pin, gpioModeInput, 0);
        GPIO->EUARTROUTE->RXROUTE = (tagconfig->debug->output.euart.rx.port << _GPIO_EUART_RXROUTE_PORT_SHIFT)
                                  | (tagconfig->debug->output.euart.rx.pin << _GPIO_EUART_RXROUTE_PIN_SHIFT);
      }

      if(tagconfig->debug->output.euart.enable.port != gpioPortInvalid) {
        GPIO_PinModeSet(tagconfig->debug->output.euart.enable.port, tagconfig->debug->output.euart.enable.pin, gpioModePushPull, 1);
      }

      sl_iostream_set_system_default(sl_iostream_instance_euart_debug_info.handle);
      break;
    default:
      DPRINTF("Unrecognised debug output\n");
      while(1) {
        sl_power_manager_sleep();
      }
  }

