abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_hw_abstraction.c
  // Now that we have debug output, log a message if we're coming back from a HW error
  uint32_t resetCause = RMU_ResetCauseGet();
  RMU_ResetCauseClear();

  if (resetCause & EMU_RSTCAUSE_WDOG0) {
    DPRINTF("*** Rebooted due to catching a hardware fault ***\n");
  }

  CMU_ClockEnable(cmuClock_WDOG0, true);
  CMU_ClockSelectSet(cmuClock_WDOG0, cmuSelect_ULFRCO);

  // Setup flash
  if(tagconfig->hwtype == BRD4402B_WSTK ||
     tagconfig->hwtype == BRD4402B_WSTK_EPD ||
     tagconfig->hwtype == MODCHIP_HD150) {
    is_devkit = true;
    //oepl_hw_flash_deepsleep();
  }
  
  // Setup pins
  if(tagconfig->gpio) {
    if(tagconfig->gpio->button1.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->gpio->button1.port, tagconfig->gpio->button1.pin, gpioModeInputPullFilter, 1);
      button1_hwval = 0x80 | tagconfig->gpio->button1.port << 4| tagconfig->gpio->button1.pin;
    } else {
      button1_hwval = 0;
    }

    if(tagconfig->gpio->button2.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->gpio->button2.port, tagconfig->gpio->button2.pin, gpioModeInputPullFilter, 1);
      button2_hwval = 0x80 | tagconfig->gpio->button2.port << 4| tagconfig->gpio->button2.pin;
    } else {
      button2_hwval = 0;
    }

    if(tagconfig->gpio->gpio.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->gpio->gpio.port, tagconfig->gpio->gpio.pin, gpioModeInput, 1);
      gpio_hwval = 0x80 | tagconfig->gpio->gpio.port << 4 | tagconfig->gpio->gpio.pin;
    } else {
      gpio_hwval = 0;
    }

    if(tagconfig->gpio->nfc_fd.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->gpio->nfc_fd.port, tagconfig->gpio->nfc_fd.pin, gpioModeInput, 0);
      nfcfd_hwval = 0x80 | tagconfig->gpio->nfc_fd.port << 4| tagconfig->gpio->nfc_fd.pin;
    } else {
      nfcfd_hwval = 0;
    }

    nfcpwr_hwval = 0;
    nfcsda_hwval = 0;
  } else {
    button1_hwval = 0;
    button2_hwval = 0;
    gpio_hwval = 0;
    nfcfd_hwval = 0;
    nfcpwr_hwval = 0;
    nfcsda_hwval = 0;
  }

  // Setup led(s)
  if(tagconfig->led) {
    if(tagconfig->led->white.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->led->white.port, tagconfig->led->white.pin, gpioModePushPull, 1);
      white_hwval =  0x80 | tagconfig->led->white.port << 4| tagconfig->led->white.pin;
    } else {
      white_hwval = 0;
    }
    if(tagconfig->led->red.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->led->red.port, tagconfig->led->red.pin, gpioModePushPull, 1);
      red_hwval =  0x80 | tagconfig->led->red.port << 4| tagconfig->led->red.pin;
    } else {
      red_hwval = 0;
    }
    if(tagconfig->led->green.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->led->green.port, tagconfig->led->green.pin, gpioModePushPull, 1);
      green_hwval =  0x80 | tagconfig->led->green.port << 4| tagconfig->led->green.pin;
    } else {
      green_hwval = 0;
    }
    if(tagconfig->led->blue.port != gpioPortInvalid) {
      GPIO_PinModeSet(tagconfig->led->blue.port, tagconfig->led->blue.pin, gpioModePushPull, 1);
      blue_hwval =  0x80 | tagconfig->led->blue.port << 4| tagconfig->led->blue.pin;
    } else {
      blue_hwval = 0;
    }
  } else {
    white_hwval = 0;
    red_hwval = 0;
    green_hwval = 0;
    blue_hwval = 0;
  }

  // Setup NFC / external-flash power (Solum routes SPI flash via I2C mux)
  if(tagconfig->nfc) {
    if(tagconfig->hwtype == SOLUM_AUTODETECT) {
      oepl_hw_solum_extflash_wake(tagconfig);
    }
  }

  // Setup power manager infrastructure
  sl_power_manager_subscribe_em_transition_event(&event_handle, &event_info);

  // Setup application NVM
  oepl_nvm_status_t status = oepl_nvm_init_default();
  if(status == NVM_ERROR) {
    // Clean our slate
    DPRINTF("Need to autodetect, lost NVM\n");
    oepl_nvm_factory_reset(oepl_efr32xg22_get_oepl_hwid());
  }

  if(oepl_nvm_setting_get(OEPL_HWID, &hwid, sizeof(hwid)) != NVM_SUCCESS) {
    // Clean our slate
    DPRINTF("Need to autodetect, lost NVM\n");
    oepl_nvm_factory_reset(oepl_efr32xg22_get_oepl_hwid());
  }

  // Cache our HWID
  oepl_nvm_setting_get(OEPL_HWID, &hwid, sizeof(hwid));
  DPRINTF("Hello OEPL tag type 0x%02x\n", hwid);

  size_t slots, slot_size;
  oepl_nvm_status_t slot_status = oepl_nvm_get_num_img_slots(&slots, &slot_size);
  if(slot_status == NVM_SUCCESS) {
    DPRINTF("Have %u image slots of %u bytes\n", (unsigned)slots, (unsigned)slot_size);
  } else {
    DPRINTF("Image slots unavailable (bulk storage not configured)\n");
  }

  if(tagconfig->nfc && tagconfig->hwtype == SOLUM_AUTODETECT &&
     slot_status == NVM_SUCCESS) {
    oepl_hw_solum_extflash_sleep(tagconfig);
  }

  // Setup display
  oepl_efr32xg22_displayparams_t displayconfig;
  bool is_valid = oepl_efr32xg22_get_displayparams(&displayconfig);
  if(!is_valid) {
    DPRINTF("Error: no valid display configuration\n");
    oepl_display_diag_log_boot(hwid, NULL);
    while(1) {
      sl_power_manager_sleep();
    }
  }

  oepl_display_diag_log_boot(hwid, &displayconfig);
  oepl_display_init(&displayconfig);
}

void oepl_hw_set_led(uint8_t color, bool on)
{
  if(red_hwval || green_hwval || blue_hwval) {
    // todo: color support using PWM on a timer
    (void) color;
    if(on) {
      if(color & 0b11100000)
      GPIO_PinOutClear((red_hwval & 0x70) >> 4, red_hwval & 0x0F);
      if(color & 0b00011100)
      GPIO_PinOutClear((green_hwval & 0x70) >> 4, green_hwval & 0x0F);
      if(color & 0b00000011)
      GPIO_PinOutClear((blue_hwval & 0x70) >> 4, blue_hwval & 0x0F);
    } else {
      if(color & 0b11100000)
      GPIO_PinOutSet((red_hwval & 0x70) >> 4, red_hwval & 0x0F);
      if(color & 0b00011100)
      GPIO_PinOutSet((green_hwval & 0x70) >> 4, green_hwval & 0x0F);
      if(color & 0b00000011)
      GPIO_PinOutSet((blue_hwval & 0x70) >> 4, blue_hwval & 0x0F);
    }
  } else if(white_hwval) {
    if(on) {
      GPIO_PinOutClear((white_hwval & 0x70) >> 4, white_hwval & 0x0F);
    } else {
      GPIO_PinOutSet((white_hwval & 0x70) >> 4, white_hwval & 0x0F);
    }
  }
}

