abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_hw_abstraction.c
static void gpioint_cb(uint8_t pin, void* ctx)
{
  if(ctx == NULL) {
    return;
  }

  if(button1_hwval && (pin == (button1_hwval & 0xF))) {
    GPIO_Port_TypeDef port = (GPIO_Port_TypeDef)((button1_hwval & 0x70) >> 4);
    oepl_hw_gpio_event_t event = (GPIO_PinInGet(port, pin) == 0) ? FALLING : RISING;
    ((oepl_hw_gpio_cb_t)ctx)(BUTTON_1, event);
  }
  if(button2_hwval && (pin == (button2_hwval & 0xF))) {
    GPIO_Port_TypeDef port = (GPIO_Port_TypeDef)((button2_hwval & 0x70) >> 4);
    oepl_hw_gpio_event_t event = (GPIO_PinInGet(port, pin) == 0) ? FALLING : RISING;
    ((oepl_hw_gpio_cb_t)ctx)(BUTTON_2, event);
  }
  if(gpio_hwval && (pin == (gpio_hwval & 0xF))) {
    ((oepl_hw_gpio_cb_t)ctx)(GENERIC_GPIO, RISING);
  }
  if(nfcfd_hwval && (pin == (nfcfd_hwval & 0xF))) {
    ((oepl_hw_gpio_cb_t)ctx)(NFC_WAKE, RISING);
  }
}

void oepl_hw_init_gpio(oepl_hw_gpio_cb_t cb)
{
  gpio_cb = cb;
  if(button1_hwval) {
    unsigned int interrupt = GPIOINT_CallbackRegisterExt(
      button1_hwval & 0xF,
      gpioint_cb,
      cb);
    GPIO_ExtIntConfig((button1_hwval & 0x70) >> 4,
                      button1_hwval & 0xF,
                      interrupt,
                      true,
                      true,
                      true);
    GPIO_IntClear(1<<(button1_hwval & 0xF));
    GPIO_IntEnable(1<<(button1_hwval & 0xF));
    DPRINTF("Registered interrupt on pin %d for Button 1\n", (button1_hwval & 0xF));
  }

  if(button2_hwval) {
    unsigned int interrupt = GPIOINT_CallbackRegisterExt(
      button2_hwval & 0xF,
      gpioint_cb,
      cb);
    GPIO_ExtIntConfig((button2_hwval & 0x70) >> 4,
                      button2_hwval & 0xF,
                      interrupt,
                      true,
                      true,
                      true);
    GPIO_IntClear(1<<(button2_hwval & 0xF));
    GPIO_IntEnable(1<<(button2_hwval & 0xF));
    DPRINTF("Registered interrupt on pin %d for Button 2\n", (button2_hwval & 0xF));
  }

  if(gpio_hwval) {
    unsigned int interrupt = GPIOINT_CallbackRegisterExt(
      gpio_hwval & 0xF,
      gpioint_cb,
      cb);
    GPIO_ExtIntConfig((gpio_hwval & 0x70) >> 4,
                      gpio_hwval & 0xF,
                      interrupt,
                      true,
                      false,
                      true);
    GPIO_IntClear(1<<(gpio_hwval & 0xF));
    GPIO_IntEnable(1<<(gpio_hwval & 0xF));
    DPRINTF("Registered interrupt on pin %d for GPIO\n", (gpio_hwval & 0xF));
  }

  if(nfcfd_hwval) {
    unsigned int interrupt = GPIOINT_CallbackRegisterExt(
      nfcfd_hwval & 0xF,
      gpioint_cb,
      cb);
    GPIO_ExtIntConfig((nfcfd_hwval & 0x70) >> 4,
                      nfcfd_hwval & 0xF,
                      interrupt,
                      true,
                      false,
                      true);
    GPIO_IntClear(1<<(nfcfd_hwval & 0xF));
    GPIO_IntEnable(1<<(nfcfd_hwval & 0xF));
    DPRINTF("Registered interrupt on pin %d for NFC field detect\n", (nfcfd_hwval & 0xF));
  }
}

bool oepl_hw_gpio_is_pressed(oepl_hw_gpio_channel_t channel)
{
  uint8_t hwval = 0;
  switch (channel) {
    case BUTTON_1:
      hwval = button1_hwval;
      break;
    case BUTTON_2:
      hwval = button2_hwval;
      break;
    default:
      return false;
  }
  if (hwval == 0) {
    return false;
  }
  GPIO_Port_TypeDef port = (GPIO_Port_TypeDef)((hwval & 0x70) >> 4);
  unsigned int pin = hwval & 0xF;
  return GPIO_PinInGet(port, pin) == 0;
}

bool oepl_hw_get_temperature(int8_t* temperature_degc)
{
  *temperature_degc = (int8_t)EMU_TemperatureGet();
  //EMU->CTRL &= ~EMU_CTRL_EM2DBGEN;
  return true;
}

bool oepl_hw_get_voltage(uint16_t* voltage_mv, bool force_measurement)
{
  static uint32_t last_measurement_ticks = 0;
  static uint16_t voltage_reading_cache = 0;

  if(force_measurement
     || sl_sleeptimer_tick_to_ms(sl_sleeptimer_get_tick_count() - last_measurement_ticks) > 60*60*1000
     || voltage_reading_cache == 0) {
    // Declare init structs
    IADC_Init_t init = IADC_INIT_DEFAULT;
    IADC_AllConfigs_t initAllConfigs = IADC_ALLCONFIGS_DEFAULT;
    IADC_InitSingle_t initSingle = IADC_INITSINGLE_DEFAULT;
    IADC_SingleInput_t initSingleInput = IADC_SINGLEINPUT_DEFAULT;

    // Enable IADC0 clock
    CMU_ClockEnable(cmuClock_IADC0, true);
    
    // Reset IADC to reset configuration in case it has been modified by
    // other code
    IADC_reset(IADC0);

    // Select clock for IADC
    CMU_ClockSelectSet(cmuClock_IADCCLK, cmuSelect_FSRCO);  // FSRCO - 20MHz

    // Modify init structs and initialize
    init.warmup = iadcWarmupNormal;

    // Set the HFSCLK prescale value here
    init.srcClkPrescale = IADC_calcSrcClkPrescale(IADC0, 20000000, 0);

    // Configuration 0 is used by both scan and single conversions by default
    // Use internal bandgap (supply voltage in mV) as reference
    initAllConfigs.configs[0].reference = iadcCfgReferenceInt1V2;
    initAllConfigs.configs[0].vRef = 1210;
    initAllConfigs.configs[0].osrHighSpeed = iadcCfgOsrHighSpeed2x;
    initAllConfigs.configs[0].analogGain = iadcCfgAnalogGain1x;

    // Divides CLK_SRC_ADC to set the CLK_ADC frequency
    initAllConfigs.configs[0].adcClkPrescale = IADC_calcAdcClkPrescale(IADC0,
                                              10000000,
                                              0,
                                              iadcCfgModeNormal,
                                              init.srcClkPrescale);

    // Assign pins to positive and negative inputs in differential mode
    initSingleInput.posInput   = iadcPosInputAvdd;
    initSingleInput.negInput   = iadcNegInputGnd;

    // Initialize the IADC
    IADC_init(IADC0, &init, &initAllConfigs);

    // Initialize the Single conversion inputs
    IADC_initSingle(IADC0, &initSingle, &initSingleInput);

    // Start IADC conversion
    IADC_command(IADC0, iadcCmdStartSingle);

    // Wait for conversion to be complete
    while((IADC0->STATUS & (_IADC_STATUS_CONVERTING_MASK
                | _IADC_STATUS_SINGLEFIFODV_MASK)) != IADC_STATUS_SINGLEFIFODV);

