abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_hw_abstraction.c
// ----------------------- Crash / Debug ---------------------------------------
void oepl_hw_reboot(void)
{
  NVIC_SystemReset();
}

void oepl_hw_crash(oepl_hw_debug_module_t module, bool reboot, const char* fmt, ...)
{
  switch(module) {
    case DBG_APP:
      printf("\n[APP-CRASH] ");
      break;
    case DBG_HW:
      printf("\n[HW-CRASH] ");
      break;
    case DBG_RADIO:
      printf("\n[RADIO-CRASH] ");
      break;
    case DBG_GPIO:
      printf("\n[GPIO-CRASH] ");
      break;
    case DBG_LED:
      printf("\n[LED-CRASH] ");
      break;
    case DBG_DISPLAY:
      printf("\n[DISP-CRASH] ");
      break;
    case DBG_NVM:
      printf("\n[NVM-CRASH] ");
      break;
    case DBG_FLASH:
      printf("\n[FLASH-CRASH] ");
      break;
    case DBG_OTHER:
      printf("\n[OTHER-CRASH] ");
      break;
  }
  
  va_list argp;
  va_start(argp, fmt);
  vprintf(fmt, argp);
  va_end(argp);

  if(reboot) {
    printf("-----------------------------------------\n");
    printf("Rebooting\n");
    printf("-----------------------------------------\n");
    oepl_hw_reboot();
  } else {
    printf("-----------------------------------------\n");
    printf("Sleeping forever\n");
    printf("-----------------------------------------\n");
    // In case of crashes early in the program, delay sleep entry such that
    // we can still connect a debugger.
    for(size_t i = 0; i < 10; i++) {
      sl_udelay_wait(100000);
    }
    oepl_hw_enter_deepsleep();
  }
}

#if GLOBAL_DEBUG_ENABLE
void oepl_hw_debugprint(oepl_hw_debug_module_t module, const char* fmt, ...)
{
  static oepl_hw_debug_module_t last_seen = DBG_OTHER;
  if(module != last_seen) {
    switch(module) {
      case DBG_APP:
        printf("\n[APP]");
        break;
      case DBG_HW:
        printf("\n[HW]");
        break;
      case DBG_RADIO:
        printf("\n[RADIO]");
        break;
      case DBG_GPIO:
        printf("\n[GPIO]");
        break;
      case DBG_LED:
        printf("\n[LED]");
        break;
      case DBG_DISPLAY:
        printf("\n[DISP]");
        break;
      case DBG_NVM:
        printf("\n[NVM]");
        break;
      case DBG_FLASH:
        printf("\n[FLASH]");
        break;
      case DBG_OTHER:
        printf("\n[OTHER]");
        break;
    }
  }
  last_seen = module;
  
  va_list argp;
  va_start(argp, fmt);
  vprintf(fmt, argp);
  va_end(argp);
}
#endif

/* Redirect all hardware errors to our custom handler */

void NMI_Handler(void)
{
  hardware_error_handler();
}

void HardFault_Handler(void)
{
  hardware_error_handler();
}

void BusFault_Handler(void)
{
  hardware_error_handler();
}

// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------
static void em_cb(sl_power_manager_em_t from,
                  sl_power_manager_em_t to)
{
  (void) from;
  (void) to;
  /*
  if(to == SL_POWER_MANAGER_EM2)  {
    DPRINTF("++S++");
  } else {
    DPRINTF("--D--");
  }
  */

  // Check whether we need a timer to detect NFC events on devices with dubious pinouts
  if((nfcfd_hwval & 0x70) == 0x20 ||
     (nfcfd_hwval & 0x70) == 0x30) {
    switch(to) {
      case SL_POWER_MANAGER_EM2:
      case SL_POWER_MANAGER_EM3:
        sl_sleeptimer_start_periodic_timer_ms(
          &nfc_poll_timer_handle,
          100,
          nfc_poll_timer_cb, NULL, 0xFF, SL_SLEEPTIMER_NO_HIGH_PRECISION_HF_CLOCKS_REQUIRED_FLAG 
        );
        break;
      default:
        sl_sleeptimer_stop_timer(&nfc_poll_timer_handle);
        break;
    }
  }
}

static void hardware_error_handler(void)
{
  // Use watchdog to trigger a reboot in a second
  WDOG_Init_TypeDef wdogInit = WDOG_INIT_DEFAULT;
  wdogInit.perSel = wdogPeriod_1k;

  // Debug print (watchdog will make us reset if this should fail/hang)
  DPRINTF("** Caught an exception! **\n");
  DPRINTF("  IRQ num %d\n", SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk);
  DPRINTF("  SHCSR %08x\n", SCB->SHCSR);
  DPRINTF("  CFSR %08x\n", SCB->CFSR);
  DPRINTF("  HFSR %08x\n", SCB->HFSR);
  DPRINTF("  DFSR %08x\n", SCB->DFSR);
  DPRINTF("  MMFAR %08x\n", SCB->MMFAR);
  DPRINTF("  BFAR %08x\n", SCB->BFAR);
  DPRINTF("  AFSR %08x\n", SCB->AFSR);

  // Wait for watchdog
  while(1);
}
